БИТУправление_медицинским_центром_демо/src/Documents/СписаниеБонусов/СписаниеБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБонусов</name>
  <registerRecords>AccumulationRegister.НакопленияПоСкидкам</registerRecords>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСгорания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРаботыСБонусами</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСкидок/ТипыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкидок</name>
  <enumValues>
    <name>Бонусы</name>
  </enumValues>
  <enumValues>
    <name>НакопительнаяСкидка</name>
  </enumValues>
  <enumValues>
    <name>Скидка</name>
  </enumValues>
  <enumValues>
    <name>Купоны</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийРаботыСБонусами/ВидыОперацийРаботыСБонусами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРаботыСБонусами</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыСкидок/ВидыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСкидок</name>
  <attributes>
    <name>ВестиУчетПоНомерамКупонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолучателя</name>
    <type>
      <types>EnumRef.ВидПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйОтборНакопления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйПериодНакопления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодАктивацииНачисленногоБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокСгоранияБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидки</name>
    <type>
      <types>EnumRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСкидки</name>
    <type>
      <types>EnumRef.ФормыСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтборНакопления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НоминалБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакоплениеБонусов</name>
    <comment>Способ расчета накопления бонусов</comment>
    <type>
      <types>EnumRef.ФормыСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммируемаяСкидка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммоваяСкидкаНаКаждуюЕдиницу</name>
    <comment>Применять суммовую скидку на каждую единицу услуги</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БонусыНеНачислятьНаПозицииСоСкидкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БонусыЗапретитьОплачиватьПозицииСоСкидкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазмерыСкидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмерыНакопления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНатуральнойСкидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШкалаДиапазонов</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПорога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/СписаниеБонусов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	Если Объект.Ссылка.Пустая() Тогда
		// Автозаполнение нового документа.
		Если Не ЗначениеЗаполнено(Объект.ВидСкидки) Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТипСкидки", Перечисления.ТипыСкидок.Бонусы);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВидыСкидок.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ВидыСкидок КАК ВидыСкидок
			|ГДЕ
			|	ВидыСкидок.ТипСкидки = &ТипСкидки";
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Если Выборка.Количество() < 2 Тогда
					Выборка.Следующий();
					Объект.ВидСкидки = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
			Объект.ВидОперации = Перечисления.ВидыОперацийРаботыСБонусами.Списание;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДатаСгоранияБонуса.Видимость = ЗначениеЗаполнено(Объект.ДатаСгорания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СозданоАвтоматически.Видимость = Объект.СозданАвтоматически;
	Если ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.КартыСкидок") Тогда
		ТипПолучателя = "Карта";
	Иначе
		ТипПолучателя = "Клиент";
	КонецЕсли;
	ИзменениеФорматаВводаПолучателя();
	
	Если Объект.Получатель.Пустая() Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Получатель;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.СуммаСписания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыборТипаПолучателяПриИзменении(Элемент)
	ИзменениеФорматаВводаПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ОбновитьПредставлениеКлиента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменениеФорматаВводаПолучателя()
	
	Если ТипПолучателя = "Клиент" Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Клиенты");
	ИначеЕсли ТипПолучателя = "Карта" Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КартыСкидок");
	Иначе
		Возврат;
	КонецЕсли;
	Элементы.Получатель.ОграничениеТипа = ОписаниеТипа;
	Объект.Получатель = ОписаниеТипа.ПривестиЗначение(Объект.Получатель);
	
	ОбновитьПредставлениеКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеКлиента()
	
	Если ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.КартыСкидок") Тогда
		Элементы.КлиентПредставление.Видимость = Истина;
		Клиент = ДопСерверныеФункции.ПолучитьРеквизит(Объект.Получатель, "ВладелецКарты");
	Иначе
		Элементы.КлиентПредставление.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
